In [2]:
from numpy import *
from pandas import *

import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [10]:
frame = DataFrame({'b':[4,7,3,2], 'a':[8,9,np.nan,8], 'c':[5,7,3,9]})
frame

   b    a  c
0  4  8.0  5
1  7  9.0  7
2  3  NaN  3
3  2  8.0  9

-- NaN
1. 알 수 없는 이유로 데이터가 존재 X
2. 0도 아니고 공백도 아님

In [4]:
frame.sum() # 결측치(nan)은 0은 아니지만, 계산의 편리를 위해 0으로 취급

b    16.0
a    25.0
c    24.0
dtype: float64

In [5]:
frame.sum(skipna=False) # NaN은 NaN으로 처리

b    16.0
a     NaN
c    24.0
dtype: float64

In [6]:
frame.idxmax() # 열단위로 가장 큰 값의 위치(index) 추출

b    1
a    1
c    3
dtype: int64

In [8]:
frame.idxmax(1) # 행단위로 가장 큰 값의 위치(index) 추출

0    a
1    a
2    b
3    c
dtype: object

In [9]:
frame.idxmax(axis=0) # 기본값

b    1
a    1
c    3
dtype: int64

In [11]:
frame.idxmin()

b    3
a    0
c    2
dtype: int64

In [12]:
frame.max()

b    7.0
a    9.0
c    9.0
dtype: float64

In [14]:
frame.max(axis=1, skipna=False)

0    8.0
1    9.0
2    NaN
3    9.0
dtype: float64

-- 데이터 분석 과정
1. 데이터를 수집 : 시간이 가장 오래 소요 (70~80%)
2. 수집된 데이터를 전처리
   -> 결측치 삭제, 수정(0, 특정값, 평균값, 앞/뒤 값으로 대체)
   -> 데이터의 양 조절
3. 머신러닝 알고리즘 적용 -> 테스트
4. 보고서

In [15]:
frame.dropna()

   b    a  c
0  4  8.0  5
1  7  9.0  7
3  2  8.0  9

In [19]:
frame.dropna(axis=0) # 기본값은 행기준으로 0이다. (idx 2행 삭제)

   b    a  c
0  4  8.0  5
1  7  9.0  7
3  2  8.0  9

In [20]:
frame.dropna(axis=1)

   b  c
0  4  5
1  7  7
2  3  3
3  2  9

In [22]:
frame2 = DataFrame({'b':[np.nan,      7,      3,      2],
                    'a':[np.nan,      9, np.nan,      8],
                    'c':[np.nan, np.nan, np.nan, np.nan]})
frame2

     b    a   c
0  NaN  NaN NaN
1  7.0  9.0 NaN
2  3.0  NaN NaN
3  2.0  8.0 NaN

In [23]:
frame2.dropna()

Empty DataFrame
Columns: [b, a, c]
Index: []

In [24]:
frame2.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [25]:
frame2.dropna(how='all') # 행기준으로 모든 요소가 NaN일 때 삭제

     b    a   c
1  7.0  9.0 NaN
2  3.0  NaN NaN
3  2.0  8.0 NaN

In [34]:
frame2.dropna(axis=1, how='all') # 열기준으로 모든 요소가 NaN일 때 삭제

     b    a
0  NaN  NaN
1  7.0  9.0
2  3.0  NaN
3  2.0  8.0

In [35]:
frame2.dropna(axis=1, thresh=2) # NaN이 2개 초과인 것 제외

     b    a
0  NaN  NaN
1  7.0  9.0
2  3.0  NaN
3  2.0  8.0

In [29]:
print(frame)
print("\n\n",frame2)

   b    a  c
0  4  8.0  5
1  7  9.0  7
2  3  NaN  3
3  2  8.0  9


      b    a   c
0  NaN  NaN NaN
1  7.0  9.0 NaN
2  3.0  NaN NaN
3  2.0  8.0 NaN

In [30]:
frame.fillna(7)

   b    a  c
0  4  8.0  5
1  7  9.0  7
2  3  7.0  3
3  2  8.0  9

In [31]:
frame2.fillna(1)

     b    a    c
0  1.0  1.0  1.0
1  7.0  9.0  1.0
2  3.0  1.0  1.0
3  2.0  8.0  1.0

In [32]:
frame.fillna({'b':5, 'a': 10, 'c': 123})

   b     a  c
0  4   8.0  5
1  7   9.0  7
2  3  10.0  3
3  2   8.0  9

In [33]:
frame2.fillna({'b':5, 'a': 10, 'c': 123})

     b     a      c
0  5.0  10.0  123.0
1  7.0   9.0  123.0
2  3.0  10.0  123.0
3  2.0   8.0  123.0

In [36]:
pd.isna(frame)

       b      a      c
0  False  False  False
1  False  False  False
2  False   True  False
3  False  False  False

In [37]:
pd.isna(frame2)

       b      a     c
0   True   True  True
1  False  False  True
2  False   True  True
3  False  False  True

In [38]:
pd.isna(frame).sum() # NaN이 있는 열 개수 세기

b    0
a    1
c    0
dtype: int64

In [39]:
pd.isna(frame2).sum()

b    1
a    2
c    4
dtype: int64

In [40]:
frame2['a'].fillna(0)

0    0.0
1    9.0
2    0.0
3    8.0
Name: a, dtype: float64

In [41]:
frame2

     b    a   c
0  NaN  NaN NaN
1  7.0  9.0 NaN
2  3.0  NaN NaN
3  2.0  8.0 NaN

In [44]:
a = frame2['a'].fillna(0)
a

0    0.0
1    9.0
2    0.0
3    8.0
Name: a, dtype: float64

In [45]:
frame2['a'].fillna('dong')

0    dong
1     9.0
2    dong
3     8.0
Name: a, dtype: object

In [46]:
frame2.fillna(frame2.mean(), axis=0) # axis =1 은 불가!
# c열은 모두 NaN이기 때문에 평균 존재 X
# pandas의 NaN은 열 단위로 다른 값으로 수정 -> axis = 1 불가

     b    a   c
0  4.0  8.5 NaN
1  7.0  9.0 NaN
2  3.0  8.5 NaN
3  2.0  8.0 NaN

In [49]:
# frame2.fillna(method="ffill") # 앞의 갚으로 대체
frame2.ffill()

     b    a   c
0  7.0  9.0 NaN
1  7.0  9.0 NaN
2  3.0  8.0 NaN
3  2.0  8.0 NaN

In [51]:
# frame2.fillna(method="bfill") # 뒤의 값으로 대체
frame2.bfill()

     b    a   c
0  7.0  9.0 NaN
1  7.0  9.0 NaN
2  3.0  8.0 NaN
3  2.0  8.0 NaN

In [54]:
a = {'b':frame2['a'].mean(), 'a':"OK", 'c':0}
frame2.fillna(value=a)

     b    a    c
0  8.5   OK  0.0
1  7.0  9.0  0.0
2  3.0   OK  0.0
3  2.0  8.0  0.0

In [55]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [56]:
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [57]:
obj.isin(['c'])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8     True
dtype: bool

In [58]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)